# GetResultSchema Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpatialFieldManager..::..GetResultSchema Method
SpatialFieldManager Class See Also
---
Returns result schema by index
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public AnalysisResultSchema GetResultSchema(
	int idx
)
```

Visual Basic
---
```text
Public Function GetResultSchema ( _
	idx As Integer _
) As AnalysisResultSchema
```

Visual C++
---
```text
public:
AnalysisResultSchema^ GetResultSchema(
	int idx
)
```

# ### Parameters
idx
    Type: System..::..Int32 Index of registered result schema
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | idx refers to non-existent result schema |

# See Also
SpatialFieldManager Class
Autodesk.Revit.DB.Analysis Namespace